Documents/А_ОказаниеУслугМеждуПодразделениями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ОказаниеУслугМеждуПодразделениями</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Необновлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКазна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_НачислятьУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ВведенВЕРП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроведеныОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПродавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПокупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредствПродавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредствПокупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Comment>ФормаОплаты</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставБДДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланФакт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейБюджетногоОтчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма в валюте банковского счета (кассы)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>А_Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма в валюте банковского счета (кассы)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОтражатьВДДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Деньги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеРасход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПриход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Comment>ФормаОплаты</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредствРасход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредствПриход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипыРасчетаДенежнымиСредствами</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКассаРасход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКассаПриход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыЗначенийПоказателейБюджетногоОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыЗначенийПоказателейБюджетногоОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныйОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечныйОстаток</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРасчетаДенежнымиСредствами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыРасчетаДенежнымиСредствами</Name>
			<Comment>Типы расчета денежными средствами для кассового чека</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредств</Name>
					<Comment>Чек продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредств</Name>
					<Comment>Чек возврата продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредств</Name>
					<Comment>Чек покупки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРасходаДенежныхСредств</Name>
					<Comment>Чек возврата покупки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныеБаллы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/А_ОказаниеУслугМеждуПодразделениями/Ext/ObjectModule.bsl
Процедура НачислитьУслугиНаСервере() Экспорт

    Услуги.Очистить();
    Деньги.Очистить();
	
    НоменклатураУслуга = Справочники.Номенклатура.НайтиПоКоду("0Ц-00000002");

    НаправлениеПриход = Перечисления.ТипыЗначенийПоказателейБюджетногоОтчета.Приход;
    НаправлениеРасход = Перечисления.ТипыЗначенийПоказателейБюджетногоОтчета.Расход;

    КоличествоСтрок = СоставБДДС.Количество();

    // ============================================================
    // ПРОХОД 1: Разбивка на группы (комментарий + позиция + баланс)
    // ============================================================
    МассивГрупп = Новый Массив;

    ТекГруппа = НоваяГруппа();

    Для Индекс = 0 По КоличествоСтрок - 1 Цикл

        ТекСтрока = СоставБДДС[Индекс];
        Направление = ТекСтрока.НаправлениеДДС;

        Если Направление <> НаправлениеПриход И Направление <> НаправлениеРасход Тогда
            Продолжить;
        КонецЕсли;

        КоммСтроки = ОчиститьКомментарий(ТекСтрока.Комментарий);
        ЭтоПриход = (Направление = НаправлениеПриход);

        // Решаем: добавить в текущую группу или начать новую
        НачатьНовую = Ложь;

        Если ТекГруппа.МассивПриход.Количество() = 0 И ТекГруппа.МассивРасход.Количество() = 0 Тогда
            // Группа пустая — добавляем
        Иначе
            ЕстьПриход = ТекГруппа.МассивПриход.Количество() > 0;
            ЕстьРасход = ТекГруппа.МассивРасход.Количество() > 0;
            КоммСовпадает = КомментарийСовпадает(КоммСтроки, ТекГруппа.Комментарии);

            // Смена направления: текущая строка Приход, а в группе уже есть Расходы
            СменаНаправления = ЭтоПриход И ЕстьРасход;

            Если СменаНаправления И ЕстьПриход И НЕ КоммСовпадает Тогда
                НачатьНовую = Истина;
            КонецЕсли;
        КонецЕсли;

        Если НачатьНовую Тогда
            МассивГрупп.Добавить(ТекГруппа);
            ТекГруппа = НоваяГруппа();
        КонецЕсли;

        // Добавляем строку в текущую группу
        Если ЭтоПриход Тогда
            ТекГруппа.МассивПриход.Добавить(Индекс);
            ТекГруппа.ИтогоПриход = ТекГруппа.ИтогоПриход + ТекСтрока.Сумма;
        Иначе
            ТекГруппа.МассивРасход.Добавить(Индекс);
            ТекГруппа.ИтогоРасход = ТекГруппа.ИтогоРасход + ТекСтрока.Сумма;
        КонецЕсли;

        Если ЗначениеЗаполнено(КоммСтроки) Тогда
            ТекГруппа.Комментарии.Вставить(КоммСтроки, Истина);
        КонецЕсли;

        // Проверяем баланс: если сошёлся и следующая строка с другим комментарием — закрываем
        Если ТекГруппа.МассивПриход.Количество() > 0
            И ТекГруппа.МассивРасход.Количество() > 0
            И ТекГруппа.ИтогоПриход > 0
            И Окр(ТекГруппа.ИтогоПриход - ТекГруппа.ИтогоРасход, 2) = 0 Тогда

            ЗакрытьГруппу = Истина;
            Если Индекс < КоличествоСтрок - 1 Тогда
                СледСтрока = СоставБДДС[Индекс + 1];
                КоммСлед = ОчиститьКомментарий(СледСтрока.Комментарий);
                Если КомментарийСовпадает(КоммСлед, ТекГруппа.Комментарии) Тогда
                    ЗакрытьГруппу = Ложь;
                КонецЕсли;
            КонецЕсли;

            Если ЗакрытьГруппу Тогда
                МассивГрупп.Добавить(ТекГруппа);
                ТекГруппа = НоваяГруппа();
            КонецЕсли;

        КонецЕсли;

    КонецЦикла;

    // Добавляем последнюю группу если непустая
    Если ТекГруппа.МассивПриход.Количество() > 0 ИЛИ ТекГруппа.МассивРасход.Количество() > 0 Тогда
        МассивГрупп.Добавить(ТекГруппа);
    КонецЕсли;

    // ============================================================
    // ПРОХОД 2: Склейка сирот по комментарию
    // ============================================================
    МассивСирот = Новый Массив;

    Для Каждого Группа Из МассивГрупп Цикл
        ЭтоСирота = (Группа.МассивПриход.Количество() = 0) ИЛИ (Группа.МассивРасход.Количество() = 0);
        Если ЭтоСирота Тогда
            МассивСирот.Добавить(Группа);
        КонецЕсли;
    КонецЦикла;

    Для Каждого Сирота Из МассивСирот Цикл

        Найдена = Ложь;
        Для Каждого Группа Из МассивГрупп Цикл
            Если Группа = Сирота Тогда
                Продолжить;
            КонецЕсли;

            КоммСовпал = Ложь;
            Для Каждого КлючЗнач Из Сирота.Комментарии Цикл
                Если Группа.Комментарии.Получить(КлючЗнач.Ключ) <> Неопределено Тогда
                    КоммСовпал = Истина;
                    Прервать;
                КонецЕсли;
            КонецЦикла;

            Если НЕ КоммСовпал Тогда
                Продолжить;
            КонецЕсли;

            Баланс = Окр(Группа.ИтогоПриход - Группа.ИтогоРасход, 2);
            Если Баланс = 0 И Группа.ИтогоПриход > 0 Тогда
                Продолжить;
            КонецЕсли;

            Для Каждого Инд Из Сирота.МассивПриход Цикл
                Группа.МассивПриход.Добавить(Инд);
            КонецЦикла;
            Группа.ИтогоПриход = Группа.ИтогоПриход + Сирота.ИтогоПриход;

            Для Каждого Инд Из Сирота.МассивРасход Цикл
                Группа.МассивРасход.Добавить(Инд);
            КонецЦикла;
            Группа.ИтогоРасход = Группа.ИтогоРасход + Сирота.ИтогоРасход;

            Для Каждого КлючЗнач Из Сирота.Комментарии Цикл
                Группа.Комментарии.Вставить(КлючЗнач.Ключ, Истина);
            КонецЦикла;

            Сирота.МассивПриход = Новый Массив;
            Сирота.МассивРасход = Новый Массив;

            Найдена = Истина;
            Прервать;
        КонецЦикла;

        Если НЕ Найдена Тогда
            Сообщить("ВНИМАНИЕ: Группа-сирота не найдена для склейки. Комментарии: "
                + КомментарииВСтроку(Сирота.Комментарии));
        КонецЕсли;

    КонецЦикла;

    // ============================================================
    // ПРОХОД 3: Генерация строк Услуги
    // ============================================================
    НомерГруппы = 0;

    Для Каждого Группа Из МассивГрупп Цикл

        Если Группа.МассивПриход.Количество() = 0 И Группа.МассивРасход.Количество() = 0 Тогда
            Продолжить;
        КонецЕсли;

        НомерГруппы = НомерГруппы + 1;

        Баланс = Окр(Группа.ИтогоПриход - Группа.ИтогоРасход, 2);
        Если Баланс <> 0 ИЛИ Группа.ИтогоПриход = 0 Тогда
            Сообщить("ВНИМАНИЕ: Группа №" + НомерГруппы + " не сбалансирована! "
                + "Приход = " + Формат(Группа.ИтогоПриход, "ЧДЦ=2")
                + ", Расход = " + Формат(Группа.ИтогоРасход, "ЧДЦ=2")
                + ", Разница = " + Формат(Баланс, "ЧДЦ=2")
                + " [" + КомментарииВСтроку(Группа.Комментарии) + "]");
        КонецЕсли;

        Если Группа.МассивПриход.Количество() > 0 И Группа.МассивРасход.Количество() > 0 Тогда
            СоздатьСтрокиУслугИзГруппы(Группа.МассивПриход, Группа.МассивРасход, НоменклатураУслуга, НомерГруппы);
        Иначе
            Сообщить("Группа №" + НомерГруппы + " содержит только "
                + ?(Группа.МассивПриход.Количество() > 0, "приходы", "расходы")
                + " — невозможно создать строки услуг."
                + " [" + КомментарииВСтроку(Группа.Комментарии) + "]");
        КонецЕсли;

    КонецЦикла;

    Сообщить("Заполнено строк Услуги: " + Услуги.Количество()
        + " из " + КоличествоСтрок + " строк БДДС, "
        + НомерГруппы + " групп.");

КонецПроцедуры

Функция НоваяГруппа() Экспорт
    Группа = Новый Структура;
    Группа.Вставить("МассивПриход", Новый Массив);
    Группа.Вставить("МассивРасход", Новый Массив);
    Группа.Вставить("ИтогоПриход", 0);
    Группа.Вставить("ИтогоРасход", 0);
    Группа.Вставить("Комментарии", Новый Соответствие);
    Возврат Группа;
КонецФункции

Функция ОчиститьКомментарий(Комментарий) Экспорт
    Результат = СокрЛП(Комментарий);
    Результат = СтрЗаменить(Результат, Символы.Таб, " ");
    Результат = СтрЗаменить(Результат, "¶", "");
    Возврат СокрЛП(Результат);
КонецФункции

Функция КомментарийСовпадает(КоммСтроки, СоответствиеКомментариев) Экспорт
    Если НЕ ЗначениеЗаполнено(КоммСтроки) Тогда
        Возврат Ложь;
    КонецЕсли;
    Возврат СоответствиеКомментариев.Получить(КоммСтроки) <> Неопределено;
КонецФункции

Функция КомментарииВСтроку(СоответствиеКомментариев) Экспорт
    Результат = "";
    Для Каждого КлючЗнач Из СоответствиеКомментариев Цикл
        Если ЗначениеЗаполнено(Результат) Тогда
            Результат = Результат + ", ";
        КонецЕсли;
        Результат = Результат + КлючЗнач.Ключ;
    КонецЦикла;
    Возврат Результат;
КонецФункции

Процедура СоздатьСтрокиУслугИзГруппы(МассивПриход, МассивРасход, НоменклатураУслуга, НомерГруппы) Экспорт

    ПерваяСтрокаПриход = СоставБДДС[МассивПриход[0]];

    ПодразделениеПродавец = А_Привилегированный.А_ПолучитьПодразделениеПоНаправлениюИПодразделениюКазны(
        ПерваяСтрокаПриход.Направление, ПерваяСтрокаПриход.Подразделение);

    СтатьяДДСПродавец = ПерваяСтрокаПриход.СтатьяДвиженияДенежныхСредств;

    КомментарийПриход = "";
    Для Каждого ИндексПриход Из МассивПриход Цикл
        СтрокаПриход = СоставБДДС[ИндексПриход];
        ТекКомментарий = СокрЛП(СтрокаПриход.Комментарий);
        Если ЗначениеЗаполнено(ТекКомментарий) И Найти(КомментарийПриход, ТекКомментарий) = 0 Тогда
            Если ЗначениеЗаполнено(КомментарийПриход) Тогда
                КомментарийПриход = КомментарийПриход + ", ";
            КонецЕсли;
            КомментарийПриход = КомментарийПриход + ТекКомментарий;
        КонецЕсли;
    КонецЦикла;

    Для Каждого ИндексРасход Из МассивРасход Цикл

        СтрокаРасход = СоставБДДС[ИндексРасход];

        Если СтрокаРасход.Сумма = 0 Тогда
            Продолжить;
        КонецЕсли;
		
		ПодразделениеПокупатель = А_Привилегированный.А_ПолучитьПодразделениеПоНаправлениюИПодразделениюКазны(
            СтрокаРасход.Направление, СтрокаРасход.Подразделение);

        НоваяСтрока = Услуги.Добавить();

        НоваяСтрока.Сумма = СтрокаРасход.Сумма;

        НоваяСтрока.ПодразделениеПокупатель = ПодразделениеПокупатель;

        НоваяСтрока.ПодразделениеПродавец = ПодразделениеПродавец;

        КомментарийРасход = СокрЛП(СтрокаРасход.Комментарий);
        НоваяСтрока.Комментарий = Лев(КомментарийПриход + " /" + КомментарийРасход, 50);

        НоваяСтрока.Номенклатура = НоменклатураУслуга;

        НоваяСтрока.СтатьяЗатрат = СтрокаРасход.СтатьяДвиженияДенежныхСредств.А_СтатьяРасходов;

        НоваяСтрока.СтатьяДвиженияДенежныхСредствПродавец = СтатьяДДСПродавец;
        НоваяСтрока.СтатьяДвиженияДенежныхСредствПокупатель = СтрокаРасход.СтатьяДвиженияДенежныхСредств;  
		НоваяСтрока.ФормаОплаты     = СтрокаРасход.ВидОплаты;	
          
		
		
		НоваяСтрокаДеньги = Деньги.Добавить();
		НоваяСтрокаДеньги.Сумма = СтрокаРасход.Сумма;
		НоваяСтрокаДеньги.ПодразделениеРасход = ПодразделениеПокупатель;
		НоваяСтрокаДеньги.ПодразделениеПриход = ПодразделениеПродавец;
		НоваяСтрокаДеньги.Сумма = СтрокаРасход.Сумма;
	    НоваяСтрокаДеньги.ФормаОплаты     = СтрокаРасход.ВидОплаты;
		НоваяСтрокаДеньги.Комментарий = Лев(КомментарийПриход + " /" + КомментарийРасход, 50);
        НоваяСтрокаДеньги.СтатьяДвиженияДенежныхСредствРасход = СтрокаРасход.СтатьяДвиженияДенежныхСредств;
		НоваяСтрокаДеньги.СтатьяДвиженияДенежныхСредствПриход = СтатьяДДСПродавец;
        НоваяСтрокаДеньги.ТипыРасчетаДенежнымиСредствами =  Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
		
		Если ЗначениеЗаполнено(НоваяСтрокаДеньги.ПодразделениеРасход.Родитель) Тогда
		   СчетКассаРасход = НоваяСтрокаДеньги.ПодразделениеРасход.Родитель.А_ОсновнойБанковскийСчет;
		Иначе	
		   СчетКассаРасход = НоваяСтрокаДеньги.ПодразделениеРасход.А_ОсновнойБанковскийСчет;
	   КонецЕсли;  
	   
	   Если ЗначениеЗаполнено(НоваяСтрокаДеньги.ПодразделениеПриход.Родитель) Тогда
		   СчетКассаПриход = НоваяСтрокаДеньги.ПодразделениеПриход.Родитель.А_ОсновнойБанковскийСчет;
		Иначе	
		   СчетКассаПриход = НоваяСтрокаДеньги.ПодразделениеПриход.А_ОсновнойБанковскийСчет;
	   КонецЕсли;
	   
	   НоваяСтрокаДеньги.СчетКассаРасход = СчетКассаРасход;
	   НоваяСтрокаДеньги.СчетКассаПриход = СчетКассаПриход;
		
    КонецЦикла;

КонецПроцедуры

Процедура ПеренестиРаспределениевУслуги() Экспорт
	
	Услуги.Очистить();
	Деньги.Очистить();

	Если Не ЗначениеЗаполнено(ДенежныйДокумент)
		ИЛИ НЕ ДенежныйДокумент.Проведен Тогда
		Возврат; 
	КонецЕсли;   
	НоменклатураУслуга = Справочники.Номенклатура.НайтиПоКоду("0Ц-00000002");
	Если ТипЗнч(ДенежныйДокумент) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") 
		 Тогда
		//Если ДенежныйДокумент.ХозяйственнаяОперация  = Перечисления.ХозяйственныеОперации.ОплатаПоставщику  Тогда
		//	
		//	
		//	
		//КонецЕсли;
		
		ПодразделениеПродавец = ДенежныйДокумент.Подразделение; 
		ФормаОплаты = Перечисления.ФормыОплаты.Безналичная;    
		СчетКассаРасход = ДенежныйДокумент.БанковскийСчет;
	ИначеЕсли ТипЗнч(ДенежныйДокумент) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
		ПодразделениеПродавец = ДенежныйДокумент.Подразделение; 
		ФормаОплаты = Перечисления.ФормыОплаты.Безналичная; 
		СчетКассаРасход = ДенежныйДокумент.БанковскийСчет;
	ИначеЕсли ТипЗнч(ДенежныйДокумент) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ПодразделениеПродавец = ДенежныйДокумент.Подразделение; 
		ФормаОплаты = Перечисления.ФормыОплаты.Наличная;
		СчетКассаРасход = ДенежныйДокумент.Касса;
	КонецЕсли;
	
	Для каждого СтрокаРасход Из А_Распределение Цикл
	 
	    НоваяСтрока = Услуги.Добавить();
        НоваяСтрока.Сумма = СтрокаРасход.Сумма;
        НоваяСтрока.ПодразделениеПокупатель =  СтрокаРасход.Подразделение;
        НоваяСтрока.ПодразделениеПродавец = ПодразделениеПродавец;
        НоваяСтрока.Номенклатура = НоменклатураУслуга;
        НоваяСтрока.СтатьяЗатрат = СтрокаРасход.СтатьяДвиженияДенежныхСредств.А_СтатьяРасходов;
        НоваяСтрока.СтатьяДвиженияДенежныхСредствПродавец = СтрокаРасход.СтатьяДвиженияДенежныхСредств;
        НоваяСтрока.СтатьяДвиженияДенежныхСредствПокупатель = СтрокаРасход.СтатьяДвиженияДенежныхСредств;
        НоваяСтрока.ФормаОплаты     = ФормаОплаты;  
		
		
		НоваяСтрокаДеньги = Деньги.Добавить();
		НоваяСтрокаДеньги.Сумма = СтрокаРасход.Сумма;
		НоваяСтрокаДеньги.ПодразделениеРасход = СтрокаРасход.Подразделение;
		НоваяСтрокаДеньги.ПодразделениеПриход = ПодразделениеПродавец;
		НоваяСтрокаДеньги.Сумма = СтрокаРасход.Сумма;
	    НоваяСтрокаДеньги.ФормаОплаты     = ФормаОплаты;
        НоваяСтрокаДеньги.СтатьяДвиженияДенежныхСредствРасход = СтрокаРасход.СтатьяДвиженияДенежныхСредств;
		НоваяСтрокаДеньги.СтатьяДвиженияДенежныхСредствПриход = СтрокаРасход.СтатьяДвиженияДенежныхСредств;
        НоваяСтрокаДеньги.ТипыРасчетаДенежнымиСредствами =  Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
        НоваяСтрокаДеньги.СчетКассаРасход     = СчетКассаРасход;
		НоваяСтрокаДеньги.СчетКассаПриход     = СчетКассаРасход;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбновитьОказаниеУслугМеждуПодразделениямиПослеОбмена() Экспорт
	
	
	Если А_ВведенВЕРП ИЛИ Закрытый ИЛИ Проверил Тогда
		Возврат;
	КонецЕсли; 
	
	Если А_Обработан Тогда
		Возврат;
	КонецЕсли;  
	
	Если А_Необновлять Тогда
		А_Обработан = Истина;	
		Возврат;
	КонецЕсли; 
	
	 НачислитьУслугиНаСервере();	
	  ПеренестиРаспределениевУслуги();
    А_Обработан = Истина; 
	
КонецПроцедуры

 Процедура ПроверитьСтатьюДенежныхСредств(СтатьяДДС)
	
	Если СтатьяДДС.А_ЗапрещеноВыбиратьВУслугиМеждуПодразделениями
		И ЗначениеЗаполнено(СтатьяДДС.А_СтатьяДенегДляВыбора) Тогда
		
		СтатьяДДС = СтатьяДДС.А_СтатьяДенегДляВыбора;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
		//***ERP
	ОбновитьОказаниеУслугМеждуПодразделениямиПослеОбмена(); 
	//***ERP
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	Если Услуги.Итог("Сумма")<>0 Тогда
		СуммаДокумента = Услуги.Итог("Сумма");
	Иначе
		СуммаДокумента = Деньги.Итог("Сумма");
	КонецЕсли;  
	
       Если ЗначениеЗаполнено(ДенежныйДокумент) Тогда
	 Контрагент = ДенежныйДокумент.Контрагент;
 КонецЕсли;  
 
 КодСтроки = 0;
Для Каждого СтрокаТЗ Из Услуги Цикл
	
	КодСтроки = КодСтроки + 1;
	СтрокаТЗ.КодСтроки = КодСтроки;
	
	ПроверитьСтатьюДенежныхСредств(СтрокаТЗ.СтатьяДвиженияДенежныхСредствПродавец);
	ПроверитьСтатьюДенежныхСредств(СтрокаТЗ.СтатьяДвиженияДенежныхСредствПокупатель);
	
КонецЦикла;
 
 КодСтроки=0;
 Для каждого СтрокаТЗ Из Деньги Цикл
	 КодСтроки=КодСтроки+1;
	 СтрокаТЗ.КодСтроки	 = КодСтроки;  
	 ПроверитьСтатьюДенежныхСредств(СтрокаТЗ.СтатьяДвиженияДенежныхСредствРасход);
	ПроверитьСтатьюДенежныхСредств(СтрокаТЗ.СтатьяДвиженияДенежныхСредствПриход);
 КонецЦикла;

КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Организация               = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);

КонецПроцедуры
